tutorials/heatTransfer/chtMultiRegionSimpleFoam/cpuCabinet/Allrun.pre
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

runApplication blockMesh
runApplication surfaceFeatureExtract
runApplication snappyHexMesh -overwrite
runApplication splitMeshRegions -cellZones -overwrite
topoSet -region domain0

# Restore initial fields
restore0Dir

#------------------------------------------------------------------------------
