tutorials/heatTransfer/chtMultiRegionSimpleFoam/cpuCabinet/system/v_fins/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

divSchemes
{
    default         Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited 0.33;
}

interpolationSchemes
{
    default         linear;
    UD              cubic;
}

snGradSchemes
{
    default         limited 0.33;
}

gradSchemes
{
    default         cellLimited leastSquares 1.0;
    grad(p)         cellLimited leastSquares 1.0;
    grad(U)         cellLimited leastSquares 1.0;
    grad(k)         cellLimited Gauss linear 1;
    grad(epsilon)   cellLimited Gauss linear 1;
}

fluxRequired
{
    default         no;
    pCorr           ;
    p_rgh           ;
}

wallDist
{
    method          meshWave;
    nRequired       false;
}


// ************************************************************************* //
